Repository: VBGAMER45/SMFMods
Catalog: prettyurls/translations/prettyurls/*.po
Languages: sv, tr

source: Installing Pretty URLs
tr: Şeker Linkler Kurulumu

source: Thank you for using <b>Pretty URLs</b>! The installation was a success!
tr: <b>Şeker Linkler</b>i kullandığınız için teşekkürler! Kurulum başarıyla tamamlandı!

source: Please continue to the admin page, where you can enable URL rewriting.
tr: Yönetim paneline geri dönerek Şeker Linkleri aktif edebilirsiniz.

source: Pretty URLs Administration
sv: Administrera Pretty URL:s
tr: Şeker Linkler Yönetim

source: News
sv: Nyheter
tr: Haberler

source: Settings
sv: Inställningar
tr: Ayarlar

source: Maintenance
sv: Underhåll
tr: Bakım

source: The latest news and information live from the project website
sv: De senaste nyheterna direkt från projektets hemsida
tr: Proje websitesinden bilgiler ve son gelişmeler

source: Pretty URLs News & Info
sv: Pretty URL:s nyheter &amp; information
tr: Şeker Linkler Haber & Bilgi

source: News & Info
sv: Nyheter &amp; information
tr: Haber & Bilgi

source: Current version
sv: Nuvarande version
tr: Kullanılan Sürüm

source: Download
sv: Ladda ned
tr: İndir

source: Latest version
sv: Senaste version
tr: Güncel Versiyon

source: Upgrade now!
sv: Uppgradera
tr: Şimdi yükselt!

source: Version info
sv: Versionsinformation
tr: Sürüm bilgisi

source: Cannot overwrite existing .htaccess file. Please change its write permissions.
sv: Kan inte skriva över befintlig .htaccess-fil. Vänligen ändra skrivrättigheterna på filen.
tr: Şu anki .htaccess dosyası değiştirilemiyor. Lütfen yazma izinlerini değiştirin.

source: Various settings
sv: Diverse inställningar
tr: Bazı Ayarlar

source: Pretty URLs Settings
sv: Inställningar Pretty URL
tr: Şeker Linkler Ayarlar

source: Core settings
sv: Grundinställningar
tr: Ana ayarlar

source: Enable URL rewriting
sv: Aktivera URL-omskrivning
tr: Url değişimini aç

source: URL rewriting filters
sv: Filter för URL-omskrivning
tr: URL Değişim Filtreleri

source: Save changes
sv: Spara ändringar
tr: Değişiklikleri Kaydet

source: Before enabling URL rewriting, please check that these rewritten links work.
tr: URL değişimini açmadan önce, lütfen değişimin çalışıp çalışmadığını kontrol edin.

source: Run some maintenance tasks
sv: Verkställ underhållsåtgärder
tr: Bazı bakım görevlerini çalıştır

source: Pretty URLs Maintenance
sv: Underhåll för Pretty URL
tr: Şeker Linkler Bakım

source: Run maintenance tasks
sv: Verkställ underhållsåtgärder
tr: Bakım görevlerini çalıştır

source: A tool to edit the filters array. The array is formatted here in the <a href="http://www.json.org/">JSON</a> format. Be careful, the JSON parser is rather strict.
sv: Ett verktyg för att ändra filtertabellen. Tabellen är formaterad i <a href="http://www.json.org/">JSON</a>-format. Var noggran, för JSON-analyseraren är ganska strikt.
tr: Filtre dizilerini düzenlemeye yarayan bir araç. Buradaki araç <a href="http://www.json.org/">JSON</a> formatındadır. Dikkat edin, JSON çözümleyici çok sıkıdır.

source: Pretty URLs Filters Tool
sv: Filtreringsverktyg Pretty URL
tr: Şeker Linkler Filtre Aracı

source: Filters Tool
sv: Filtreringsverktyg
tr: Filtre Aracı

source: The PHP JSON extension is required for this tool. Consider upgrading to PHP 5.2.
sv: PHP-utökningen JSON krävs av det här verktyget. Överväg att uppgradera till PHP 5.2.
tr: PHP'nin JSON eklentisi bu araç için gereklidir. PHP 5.2 sürümüne güncelleyin.

source: Pretty URLs
tr: Şeker Linkler

source: Add
sv: Lägg till
tr: Ekle

source: Add a URL. Note that what you enter here will be processed as only certain characters are allowed.
sv: Lägg till en URL. Notera att det du ger in här kommer att processas, då endast vissa tecken är tillåtna.
tr: URL Ekleyin. Buraya gireceğiniz karakterlerden sadece bazılarına izin verildiğini unutmayın.

source: Pretty URLs for:
sv: Pretty URLs för:
tr: Şunlar için Şeker Linkler :

source: Deleted board #
sv: Tog bort tavla #
tr: Silinen bölüm #

source: delete it first.
sv: radera den först.
tr: ilkini silin.

source: That URL is already in use by another board. It will be available if you
sv: Den URL:en används redan till en annan tavla. Den blir tillgänglig om du
tr: Bu URL başka bir bölüm tarafından kullanıyor. Kullanabilmek için

source: Make primary
sv: Gör primär
tr: Birincil yap

source: Warning, no primary URL!
sv: Varning, ingen primär URL!
tr: Dikkat, birincil URL yok!

source: Sorry, but as that URL is either a number or the same as a forum action the board ID had to be added as a suffix.
sv: Den URL:en är antingen ett nummer eller en forumshandling som måste läggas till som suffix.
tr: Üzgünüm, ama bu URLnin sonunda bir rakam olması gerekiyor, bu aynı isimle bulunan bölümleri birbirinden ayırmak için kullanıyor, aynı isimli iki forum actionı gibi.

source: Primary
sv: Primär
tr: Birincil

source: [b][url=http://custom.simplemachines.org/mods/index.php?mod=636]Pretty URLs[/url][/b] is a URL management package for Simple Machine Forums (SMF). It is simple, powerful, extensible and free. Most of all, it is pretty! Its main purpose is to rewrite the important SMF URLs, like these: [list] [li][nobbc]http://domain.com/board/topic/[/nobbc][/li] [li][nobbc]http://domain.com/profile/user/[/nobbc][/li] [li][nobbc]http://domain.com/unreadreplies/[/nobbc][/li] [/list] Pretty URLs will work with SMF 1.1 and 2.0. It requires an Apache webserver with support for mod_rewrite and .htaccess files. [url=http://code.google.com/p/prettyurls/]Project home page[/url] [b][url=http://code.google.com/p/prettyurls/wiki/Overview]Overview and installation info[/url][/b] Need help? [b][url=http://code.google.com/p/prettyurls/wiki/TroubleShooting]Check the trouble shooting page first![/url][/b] Pretty URLs is released under a [url=http://prettyurls.googlecode.com/svn/trunk/LICENCE]new BSD licence[/url] Copyright (c) 2006-2009 [url=http://prettyurls.googlecode.com/svn/trunk/CONTRIBUTORS]The Pretty URLs Contributors[/url]
tr: [b][url=http://custom.simplemachines.org/mods/index.php?mod=636]Pretty URLs[/url][/b] Simple Machine Forums (SMF) sistemleri için URL yönetimi sağlayan bir eklentidir. Basit, güçlü, geliştirilebilir ve ücretsiz! Tamamı çok kolay ve gerçekten şirin! Temel amacı önemli SMF URLlerini yeniden düzenlemektir. Örneğin: [list] [li][nobbc]http://siteniz.com/bölüm-ismi/konu/[/nobbc][/li] [li][nobbc]http://siteniz.com/profile/kullanıcı-adı/[/nobbc][/li] [li][nobbc]http://siteniz.com/unreadreplies/[/nobbc][/li] [/list] Şeker Linker SMF 1.1 ve 2.0 ile uyumludur. Doğru çalışabilmesi için mod_rewrite yüklü olan ve .htaccess dosyasını destekleyen bir Apache sunucu gerektirir. [url=http://code.google.com/p/prettyurls/]Proje Anasayfası[/url] [b][url=http://code.google.com/p/prettyurls/wiki/Overview]Genel Bakış ve Kurulum Bilgileri[/url][/b] Yardıma mı ihtiyacınız var? [b][url=http://code.google.com/p/prettyurls/wiki/TroubleShooting]Öncelikle hata çözme sayfasını inceleyin![/url][/b] Pretty URLs [url=http://prettyurls.googlecode.com/svn/trunk/LICENCE]yeni BSD lisansı[/url] altında yayınlanmaktadır Copyright (c) 2006-2009 [url=http://prettyurls.googlecode.com/svn/trunk/CONTRIBUTORS]Pretty URLs Ekibi[/url]

source: Thank you for using [b]Pretty URLs[/b]! If you don't intend to reinstall this mod, you should consider using the Reverter package, which will redirect your pretty URLs back to the normal SMF URLs. This should be considered essential if your forum has been indexed by search engines, or if your pages have been linked to from other websites. You can download the Reverter package from the [url=http://code.google.com/p/prettyurls]Pretty URLs project home page[/url]. [b]Note:[/b] to install the Reverter package do not remove the database settings, tables and .htaccess file.
tr: [b]Şeker Linkler[/b]i kullandığınız için teşekkürler! Herhangi bir şekilde paketi kaldırdığınızda, Reverter paketini kurmalısınız. Bu paket Şeker Linklere çevrilmiş eski URLlerden gelen ziyaretçilerinizi normal SMF URLlerine yönlendirecek. Tabiki bu paketi kurmanız arama motorları ve sizin linklerinizi sitelerden gelen ziyaretçilerinizin doğru yere yönlenmelerini sağlayacak. Reverter paketini [url=http://code.google.com/p/prettyurls]Şeker Linkler proje anasayfası[/url]ndan indirebilirsiniz. [b]Not:[/b] Reverter paketini kurmadan önce veritabanı tablolarını ve .htaccess dosyanızı [b]silmemelisiniz[/b]
